Repository: MatushkinaAnastasia/Settings
Catalog: Settings/finex.CollectionFunctions/finex.CollectionFunctions.Shared/Module.*.resx
Languages: ru

# LastVersionNotApproved_Approval
source: To convert to PDF, the latest version of the document must be signed with a approval signature.
ru: Для преобразования в PDF должна быть подписана последняя версия документа согласующей подписью.

# LastVersionNotApproved_Endorsing
source: To convert to PDF, the latest version of the document must be signed with a endorsing signature.
ru: Для преобразования в PDF должна быть подписана последняя версия документа удтверждающей подписью.

# LastVersionNotApproved_NotEndorsing
source: To convert to PDF, you must sign the latest version of the document with not endorsing sign.
ru: Для преобразования в PDF должна быть подписана последняя версия документа с отказом в утверждении.

# NotDocumentVersion
source: There are no versions in the document.
ru: В документе нет ни одной версии.

# ShowFilesDialog_FileExtentionError
source: File extensions "*.{0}" are not allowed for download.
ru: Расширения файлов "*.{0}" запрещены для загрузки.

# ShowFilesDialog_FileSelector
source: File:
ru: Файл:

# PdfConvertError
source: Cannot convert the document to PDF.
ru: Не удалось преобразовать документ в формат PDF.

# NotCurrentEmployee
source: The current user has no employee!
ru: У текущего пользователя отсутствует сотрудник!

# NotCurrentEmployeeBusinessUnit
source: The current employee does not have our organization!
ru: У текущего сотрудника отсутствует наша организация!

# NotCurrentEmployeeDepartment
source: The current employee has no department!
ru: У текущего сотрудника отсутствует подразделение!

# DialogCreateVersionFileTitle
source: Create version of document {0}
ru: Создание версии документа {0}

# DocumentMissing
source: Missing document. Version creation canceled!
ru: Отсутствует документ. Создание версии отменено!

# CreateVersionComplite
source: The version creation is complete.
ru: Создание версии завершено.

# DialogsReqName_DocKind
source: Type of document
ru: Вид документа

# DialogsReqName_Worker
source: Worker
ru: Работник

# DialogsReqName_Employee
source: Employee
ru: Сотрудник

# DialogsReqName_DateFrom
source: Date from
ru: Дата с

# DialogsReqName_DateTo
source: Date to
ru: Дата по

# DialogsReqName_Department
source: Department
ru: Подразделение

# DialogsReqName_Employees
source: Employees
ru: Сотрудники

# DialogsReqName_Workers
source: Workers
ru: Работники

# DialogsReqName_Departments
source: Departments
ru: Подразделения

# DialogsReqName_CreateDateTo
source: Date of creation by
ru: Дата создания по

# DialogsReqName_CreateDateFrom
source: Date of creation from
ru: Дата создания с

# DialogsReqName_TypePosition
source: Type of position
ru: Вид должности
